[
  {
    "id": 1,
    "title": "Scenario 1: The Onboarding Bottleneck",
    "scenario": "A new Member Onboarding workflow is due tomorrow. You’ve finished your scripts, but a teammate is struggling with a technical hurdle in the automation. This teammate is your peer.",
    "options": [
      { "label": "A", "text": "Send your completed work to the manager immediately to show you’ve met your deadline." },
      { "label": "B", "text": "Offer to hop on a call with the teammate to share your process and help them troubleshoot." },
      { "label": "C", "text": "Wait for the teammate to ask for help; you don’t want to overstep or make them feel incompetent." },
      { "label": "D", "text": "Check your work one more time to ensure your \"A+\" is secured, then head home." }
    ]
  },
  {
    "id": 2,
    "title": "Scenario 2: The Funnel Shortcut",
    "scenario": "You’ve discovered a shortcut in the Marketing Funnel CRM that saves you two hours of manual lead tracking every week.",
    "options": [
      { "label": "A", "text": "Keep it to yourself so you can use that extra time for personal projects and stand out." },
      { "label": "B", "text": "Mention it to your manager during your next 1-on-1 to show your individual innovation." },
      { "label": "C", "text": "Document the process and share it with the team so everyone can save time." },
      { "label": "D", "text": "Use the shortcut but only share it if you see someone else specifically struggling." }
    ]
  },
  {
    "id": 3,
    "title": "Scenario 3: The Unearned Praise",
    "scenario": "During a meeting, your manager praises you for a brilliant idea that was actually sparked by a casual comment a teammate made during lunch.",
    "options": [
      { "label": "A", "text": "Accept the praise; it was your execution that made the idea work anyway." },
      { "label": "B", "text": "Thank the manager, then privately tell the teammate later that you appreciated their input." },
      { "label": "C", "text": "Immediately speak up: \"I can't take full credit; [Name] brought up the core concept.\"" },
      { "label": "D", "text": "Say \"The team worked hard on this,\" without naming the specific person." }
    ]
  },
  {
    "id": 4,
    "title": "Scenario 4: The Ecological Design Query",
    "scenario": "A potential member sends an urgent technical request about Ecological Design specifics. It falls into a \"gray area\"—it’s not strictly BI's job, but the person who handles it is at a farm site without signal.",
    "options": [
      { "label": "A", "text": "Explain to the client that the responsible party is out and give them a return date." },
      { "label": "B", "text": "Try to resolve the issue yourself to protect the team’s reputation and help the client." },
      { "label": "C", "text": "Forward the email to your manager so they can decide who should handle it." },
      { "label": "D", "text": "Ignore the email; responding might set a precedent that you are now responsible for this." }
    ]
  },
  {
    "id": 5,
    "title": "Scenario 5: The Campaign Delay",
    "scenario": "The Community Engagement campaign launched late. The manager asks what went wrong. You know a teammate forgot an approval, but you also could have checked in on them.",
    "options": [
      { "label": "A", "text": "Stay silent and let the teammate explain themselves; it’s their responsibility." },
      { "label": "B", "text": "Say, \"It was a breakdown in communication. I should have followed up to confirm.\"" },
      { "label": "C", "text": "Message the manager after the meeting to clarify exactly whose fault it was." },
      { "label": "D", "text": "Make up a technical excuse (like a server error) to keep everyone out of trouble." }
    ]
  },
  {
    "id": 6,
    "title": "Scenario 6: The Documentation Request",
    "scenario": "You lead a complex BI process only you know. Your manager asks for a \"How-To\" manual so others can step in if you are ever unavailable.",
    "options": [
      { "label": "A", "text": "Create a brief outline but leave out the nuances; some things are better learned by doing." },
      { "label": "B", "text": "Create a comprehensive guide so simple that a junior member could handle it." },
      { "label": "C", "text": "Suggest it’s more efficient for you to just do it, as teaching others takes too long." },
      { "label": "D", "text": "Use the request as leverage to ask for a promotion or raise before sharing the info." }
    ]
  },
  {
    "id": 7,
    "title": "Scenario 7: The CEO's Weekend Request",
    "scenario": "It is Saturday. An urgent issue arises with the Farm Productivity dashboard. The CEO needs a quick 10-minute fix for a Monday presentation.",
    "options": [
      { "label": "A", "text": "Ignore the message until Monday; weekends are a strictly \"no-work\" zone." },
      { "label": "B", "text": "Provide the info quickly, then suggest a meeting Monday to ensure others have this info." },
      { "label": "C", "text": "Handle the issue, but remind the manager Monday how \"lost\" the team would be without you." },
      { "label": "D", "text": "Block work contacts during off-hours to ensure your time is never interrupted." }
    ]
  },
  {
    "id": 8,
    "title": "Scenario 8: The Broken Build",
    "scenario": "You accidentally pushed code that broke the Sales Enablement toolkit. No one has noticed yet, and you could probably fix it quietly in an hour.",
    "options": [
      { "label": "A", "text": "Fix it quietly and hope no one checks the logs." },
      { "label": "B", "text": "Alert the team channel immediately, apologize, and start fixing." },
      { "label": "C", "text": "Wait until someone reports the error, then act surprised." },
      { "label": "D", "text": "Claim the build server has been acting up lately." }
    ]
  },
  {
    "id": 9,
    "title": "Scenario 9: The Loudest Voice",
    "scenario": "In a planning meeting, the loudest person is pushing a plan you know is flawed. The quietest person has a better idea but isn't speaking up.",
    "options": [
      { "label": "A", "text": "Let the loud person win; it's not worth the conflict." },
      { "label": "B", "text": "Publicly ask the quiet person for their thoughts to give them the floor." },
      { "label": "C", "text": "Message the quiet person later and tell them they should have spoken up." },
      { "label": "D", "text": "Interrupt the loud person aggressively to shut them down." }
    ]
  },
  {
    "id": 10,
    "title": "Scenario 10: The AI Support Suggestion",
    "scenario": "A junior developer suggests a new AI Integration for Member Support that seems unnecessary to you. You are the senior lead.",
    "options": [
      { "label": "A", "text": "Dismiss it immediately; you know the codebase better." },
      { "label": "B", "text": "Ask them to walk you through their reasoning and prototype it." },
      { "label": "C", "text": "Let them do it, expecting them to fail so they learn a lesson." },
      { "label": "D", "text": "Take the core idea, polish it, and present it as your own optimization." }
    ]
  },
  {
    "id": 11,
    "title": "Scenario 11: The Rumor Mill",
    "scenario": "You hear a rumor that layoffs are coming. A stressed teammate asks if you know anything.",
    "options": [
      { "label": "A", "text": "Share the rumor to help them prepare, even if it's unverified." },
      { "label": "B", "text": "Say \"I haven't heard anything official,\" and encourage them not to panic." },
      { "label": "C", "text": "Tell them everything is definitely fine to protect their feelings." },
      { "label": "D", "text": "Add your own speculation about which department is at risk." }
    ]
  },
  {
    "id": 12,
    "title": "Scenario 12: The CEO's Vague Task",
    "scenario": "The CEO assigns you a task regarding 'Sales Enablement Metrics' with very vague instructions. They are currently busy in meetings.",
    "options": [
      { "label": "A", "text": "Wait until they are free to ask for clarification, even if it delays work." },
      { "label": "B", "text": "Draft a proposal of what you think needs doing and send it for async approval." },
      { "label": "C", "text": "Do what you want; if it's wrong, it's their fault for not being clear." },
      { "label": "D", "text": "Complaining to peers that leadership is disorganized." }
    ]
  },
  {
    "id": 13,
    "title": "Scenario 13: The Chronic Lateness",
    "scenario": "A peer is consistently late to stand-up, which is starting to annoy the team.",
    "options": [
      { "label": "A", "text": "Bring it up in the retrospective publicly to shame them into changing." },
      { "label": "B", "text": "Check in privately to see if everything is okay with their schedule." },
      { "label": "C", "text": "Start showing up late too; fair is fair." },
      { "label": "D", "text": "Report them to the manager immediately." }
    ]
  },
  {
    "id": 14,
    "title": "Scenario 14: The Credit Steal (Reverse)",
    "scenario": "A colleague takes credit for a small fix you made. It's minor, but annoying.",
    "options": [
      { "label": "A", "text": "Call them out in front of everyone." },
      { "label": "B", "text": "Mention privately: \"Hey, glad that fix worked, but please credit me next time.\"" },
      { "label": "C", "text": "Let it slide; you don't want to seem petty." },
      { "label": "D", "text": "Stop helping them in the future." }
    ]
  },
  {
    "id": 15,
    "title": "Scenario 15: The Ecological Data Map",
    "scenario": "The Ecological Design team is swamped and asks for help with manual plot data mapping. You have free time but it's boring work.",
    "options": [
      { "label": "A", "text": "Decline; you are a developer, not a field analyst." },
      { "label": "B", "text": "Jump in to help clear the backlog; it helps the company's ecological goals." },
      { "label": "C", "text": "Agree only if you can get a favor in return later." },
      { "label": "D", "text": "Do it, but make sure everyone knows you are doing them a huge favor." }
    ]
  },
  {
    "id": 16,
    "title": "Scenario 16: The Quick Fix",
    "scenario": "You find a bug that will take 3 days to fix properly or 1 hour to patch with a hack.",
    "options": [
      { "label": "A", "text": "Patch it. Speed is what matters most." },
      { "label": "B", "text": "Explain the trade-off to stakeholders and advocate for the proper fix." },
      { "label": "C", "text": "Hide the bug so you don't have to deal with it right now." },
      { "label": "D", "text": "Assign the ticket to someone else." }
    ]
  },
  {
    "id": 17,
    "title": "Scenario 17: The Feedback Sandwich",
    "scenario": "You need to give critical feedback to a sensitive teammate.",
    "options": [
      { "label": "A", "text": "Be brutally honest; feelings shouldn't matter in business." },
      { "label": "B", "text": "Be direct but kind, focusing on the work behavior, not the person." },
      { "label": "C", "text": "Avoid giving the feedback to keep the peace." },
      { "label": "D", "text": "Give so much praise they don't even realize you criticized them." }
    ]
  },
  {
    "id": 18,
    "title": "Scenario 18: The Vacation Handover",
    "scenario": "You are going on vacation for a week. The Member Onboarding rollout is active.",
    "options": [
      { "label": "A", "text": "Tell them to call you if anything burns down." },
      { "label": "B", "text": "Prepare detailed docs and brief a designated backup person." },
      { "label": "C", "text": "Just set an out-of-office reply; they'll figure it out." },
      { "label": "D", "text": "Secretly check email every day because you don't trust them." }
    ]
  },
  { "id": 19,
    "title": "Scenario 19: The Team Win",
    "scenario": "The new Farm Management tool launched successfully. The CEO asks you how it went.",
    "options": [
      { "label": "A", "text": "Tell them how hard *you* worked to get it over the line." },
      { "label": "B", "text": "Highlight the specific contributions of your teammates." },
      { "label": "C", "text": "Mention the problems you had to overcome (complaining)." },
      { "label": "D", "text": "Ask if this means you get a bonus." }
    ]
  },
  {
    "id": 20,
    "title": "Scenario 20: The Legacy Reconciliation",
    "scenario": "A new hire asks why the Member Finance reconciliation is so bad. You know it was a legacy manual process from years ago.",
    "options": [
      { "label": "A", "text": "Defend the process blindly to show loyalty." },
      { "label": "B", "text": "Explain the historical context honestly but admit it needs improvement." },
      { "label": "C", "text": "Bash the process and the original author to bond with the new hire." },
      { "label": "D", "text": "Tell them not to ask questions like that." }
    ]
  }
]